Revit 2018 API
StructuralSectionISlopedFlange Constructor
Overload List
Name | Description
StructuralSectionISlopedFlange(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double) |  Obsolete.
 Creates a new instance of Structural Section I Sloped Flange shape with the associated set of parameters, used to attach to structural element.
StructuralSectionISlopedFlange(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double)
 Creates a new instance of Structural Section I Sloped Flange shape with the associated set of parameters, used to attach to structural element.
See Also
StructuralSectionISlopedFlange Class
StructuralSectionISlopedFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace